Revit 2027 API
HVACLoadType.SensibleHeatGainPerPerson Property
 The sensible heat gain per person.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SensibleHeatGainPerPerson { get; set; }
Public Property SensibleHeatGainPerPerson As Double
	Get
	Set
public:
property double SensibleHeatGainPerPerson {
	double get ();
	void set (double value);
}
member SensibleHeatGainPerPerson : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The value should be between [0.0,5381.9].
See Also
Reference
HVACLoadType Class
Autodesk.Revit.DB.Analysis Namespace